In [74]:
import pandas as pd

In [75]:
#load data
raw_data = pd.read_csv("titanic_full.csv")

In [76]:
raw_data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [77]:
#shape
len(raw_data)

891

In [78]:
raw_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [79]:
raw_data.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [80]:
raw_data[['Name', 'Age']].head()

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

In [81]:
raw_data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [82]:
clean_data = raw_data.drop("Cabin" , axis=1)

In [83]:
clean_data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [84]:
clean_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

In [85]:
clean_data.Age.mean()

29.69911764705882

In [86]:
clean_data.Age.mode()

0    24.0
Name: Age, dtype: float64

In [87]:
median_age=clean_data.Age.median()

In [88]:
clean_data["Age"] = clean_data['Age'].fillna(median_age)

In [89]:
clean_data.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [90]:
clean_data["Embarked"] = clean_data['Embarked'].fillna('U')

In [91]:
clean_data.Embarked

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [92]:
clean_data.to_csv('clean_data_titanic.csv', index= False)

preprocessing data for model building

In [93]:
preprocessed_data = pd.read_csv('clean_data_titanic.csv')

In [94]:
preprocessed_data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [95]:
gender_columns= pd.get_dummies(preprocessed_data['Sex'], prefix='sex')

In [96]:
gender_columns.head()

   sex_female  sex_male
0           0         1
1           1         0
2           1         0
3           1         0
4           0         1

In [97]:
embarked_columns= pd.get_dummies(preprocessed_data['Embarked'], prefix='embarked')

In [98]:
embarked_columns.head()

   embarked_C  embarked_Q  embarked_S  embarked_U
0           0           0           1           0
1           1           0           0           0
2           0           0           1           0
3           0           0           1           0
4           0           0           1           0

In [99]:
preprocessed_data = pd.concat([preprocessed_data, gender_columns],axis=1)

In [100]:
preprocessed_data = pd.concat([preprocessed_data, embarked_columns], axis=1)

In [101]:
preprocessed_data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,sex_female,sex_male,embarked_C,embarked_Q,embarked_S,embarked_U
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,0,1,0,0,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,1,0,1,0,0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,1,0,0,0,1,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,1,0,0,0,1,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,0,1,0,0,1,0

In [109]:

first_class = preprocessed_data[preprocessed_data.Pclass == 1]

In [116]:
sum(first_class['Survived'])/len(first_class) *100

62.96296296296296

In [112]:
second_class = preprocessed_data[preprocessed_data.Pclass == 2]

In [120]:
sum(second_class['Survived'])/len(second_class) *100

47.28260869565217

In [114]:

third_class = preprocessed_data[preprocessed_data.Pclass == 3]

In [119]:
sum(second_class['Survived'])/len(third_class) *100

17.718940936863543

In [128]:
#to drop : preprocessed_data = preprocessed_data.drop(['Name', 'Sex', 'Embarked','Ticket'], axis=1 )

In [129]:
preprocessed_data.head()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,sex_female,sex_male,embarked_C,embarked_Q,embarked_S,embarked_U
0,1,0,3,22.0,1,0,7.2500,0,1,0,0,1,0
1,2,1,1,38.0,1,0,71.2833,1,0,1,0,0,0
2,3,1,3,26.0,0,0,7.9250,1,0,0,0,1,0
3,4,1,1,35.0,1,0,53.1000,1,0,0,0,1,0
4,5,0,3,35.0,0,0,8.0500,0,1,0,0,1,0

In [131]:
preprocessed_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare',
       'sex_female', 'sex_male', 'embarked_C', 'embarked_Q', 'embarked_S',
       'embarked_U'],
      dtype='object')

MODEL BUILDING

In [132]:
features = preprocessed_data.drop('Survived', axis=1)
label = preprocessed_data['Survived']

In [133]:
features.columns

Index(['PassengerId', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'sex_female',
       'sex_male', 'embarked_C', 'embarked_Q', 'embarked_S', 'embarked_U'],
      dtype='object')

In [135]:
label

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [137]:
pip install --upgrade pip

Requirement already satisfied: pip in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (21.2.3)
Collecting pip
  Downloading pip-22.2.2-py3-none-any.whl (2.0 MB)
     |████████████████████████████████| 2.0 MB 102 kB/s eta 0:00:01
Installing collected packages: pip
  Attempting uninstall: pip
    Found existing installation: pip 21.2.3
    Uninstalling pip-21.2.3:
      Successfully uninstalled pip-21.2.3
  WARNING: The scripts pip, pip3 and pip3.10 are installed in '/Library/Frameworks/Python.framework/Versions/3.10/bin' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.
Successfully installed pip-22.2.2
Note: you may need to restart the kernel to use updated packages.

In [138]:
pip install scikit learn

ERROR: Could not find a version that satisfies the requirement scikit (from versions: none)
ERROR: No matching distribution found for scikit
Note: you may need to restart the kernel to use updated packages.